package ru.question;

import java.util.Arrays;
import java.util.Scanner;

public class Main {

    public static void main(String[] args) {

        int errcnt = 0; // количество ошибочных

        //можно было бы сразу из 2х одинарных ниже сделать двумерный массив, но для учебного задания нагляднее так
        //массив вопросов
        String[] questions = {"Два конца, два кольца,посредине гвоздик",
                "Не огонь, а жжется",
                "Без рук, без топоренка, построена избенка"};
        //массив номеров правильных ответов
        int[] corrects = {2, 1, 3};

        //двухмерный массив ответов
        String[][] answers = {
                {"Молоток", "Ножницы", "Циркуль"},
                {"Крапива", "Солнце", "Водка"},
                {"Дом", "Коробка", "Гнездо"}
        };

        Scanner scanner = new Scanner(System.in);
        //печать заголовка
        System.out.println(" *************************************************************************");
        System.out.println("   Ответьте на 3 загадки. Надо ввести номер правильного ответа (1-3)      ");
        System.out.println(" *************************************************************************");

        // == цикл по вопросам ==
        for (int i = 1; i < 4; i++) {
            System.out.println("Вопрос N" + i + ": " + questions[i - 1]);
            //печать вариантов
            for (int j = 1; j < 4; j++) {
                System.out.println(j + "." + answers[i - 1][j - 1]);
            }
            //запрос ответа (по-хорошему надо обернуть эксепшеном, но еще не проходили)
            int a = scanner.nextInt();

            if (a == corrects[i - 1]) {
                System.out.println("Верно!");
            } else {
                // Про corrects[i-1]-1 Два раза -1 потому, что индексы массивов с 0 начинаются.
                System.out.println("Неверно ! Правильный ответ: " + (corrects[i - 1]) + "." + answers[i - 1][corrects[i - 1] - 1]);
                errcnt++;
            } //конец обработки условного оператора
            System.out.println();
        }
        System.out.println(" *************************************************************************");
        System.out.println(" Ваши результаты - Правильных ответов:" + (3 - errcnt) + ", Неправильных:" + errcnt);
        System.out.println(" *************************************************************************");

    }
}
